Revit 2027 API
Form.Rehost(Reference, XYZ) Method
Rehost Form to edge, face or curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Rehost(
	Reference hostRef,
	XYZ location
)
Public Sub Rehost (
	hostRef As Reference,
	location As XYZ
)
public:
void Rehost(
	Reference^ hostRef,
	XYZ^ location
)
member Rehost :
        hostRef : Reference *
        location : XYZ -> unit
Parameters
hostRef Reference
The geometry reference on which to rehost the form.
location XYZ
The location to which to Rehost the form.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the hostRef or location is null.
InvalidOperationException | Thrown when rehosting Form failed.
See Also
Reference
Form Class
Rehost Overload
Autodesk.Revit.DB Namespace